case/porosityPrec/0.orig/SuOut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      SuOut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
        value           $internalField;
    }
    sphere1
    {
        type            zeroGradient;
        value           $internalField;
    }
    sphere2
    {
        type            zeroGradient;
        value           $internalField;
    }
    sphere3
    {
        type            zeroGradient;
        value           $internalField;
    }
    sphere4
    {
        type            zeroGradient;
        value           $internalField;
    }
    periodicWall
    {
        type            symmetry;
    }
    "proc.*"
    {
        type    processor;
    }
}

// ************************************************************************* //
