case/porosityPrec/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Include defaults parameters from master dictionary
//#includeEtc "/opt/openfoam6/etc/caseDicts/mesh/generation/meshQualityDict"
//#includeEtc "/home/vsv/OpenFOAM/OpenFOAM-v1712/etc/caseDicts/mesh/generation/meshQualityDict.cfg"
#includeEtc "caseDicts/meshQualityDict"

// ************************************************************************* //
